tiborsimon/embedded-tdd-headers/pic/8bit/pic18f45k80_tdd.h
#define TXB0EID17                     3323
#define TXB0EXIDE                     3324
#define TXB0SIDL_EXIDE                3325
#define TXB0SIDL_SRR                  3326
#define TXB0SID0                      3327
#define TXB0SIDL_SID0                 3328
#define TXB0SIDL_SID                  3329
#define TXB0SID1                      3330
#define TXB0SIDL_SID1                 3331
#define TXB0SID2                      3332
#define TXB0SIDL_SID2                 3333
#define TXB0EIDH                      3334
#define TXB0EIDH_EID8                 3335
#define TXB0EID8                      3336
#define TXB0EIDH_EID                  3337
#define TXB0EIDH_EID9                 3338
#define TXB0EID9                      3339
#define TXB0EIDH_EID10                3340
#define TXB0EID10                     3341
#define TXB0EIDH_EID11                3342
#define TXB0EID11                     3343
#define TXB0EIDH_EID12                3344
#define TXB0EID12                     3345
#define TXB0EIDH_EID13                3346
#define TXB0EID13                     3347
#define TXB0EIDH_EID14                3348
#define TXB0EID14                     3349
#define TXB0EIDH_EID15                3350
#define TXB0EID15                     3351
#define TXB0EIDL                      3352
#define TXB0EIDL_EID                  3353
#define TXB0EIDL_EID0                 3354
#define TXB0EID0                      3355
#define TXB0EIDL_EID1                 3356
#define TXB0EID1                      3357
#define TXB0EIDL_EID2                 3358
#define TXB0EID2                      3359
#define TXB0EIDL_EID3                 3360
#define TXB0EID3                      3361
#define TXB0EIDL_EID4                 3362
#define TXB0EID4                      3363
#define TXB0EIDL_EID5                 3364
#define TXB0EID5                      3365
#define TXB0EIDL_EID6                 3366
#define TXB0EID6                      3367
#define TXB0EIDL_EID7                 3368
#define TXB0EID7                      3369
#define TXB0DLC                       3370
#define TXB0DLC0                      3371
#define TXB0DLC_DLC                   3372
#define TXB0DLC_DLC0                  3373
#define TXB0DLC1                      3374
#define TXB0DLC_DLC1                  3375
#define TXB0DLC2                      3376
#define TXB0DLC_DLC2                  3377
#define TXB0DLC3                      3378
#define TXB0DLC_DLC3                  3379
#define TXB0RTR                       3380
#define TXB0DLC_TXRTR                 3381
#define TXB0D0                        3382
#define TXB0D00                       3383
#define TXB0D01                       3384
#define TXB0D02                       3385
#define TXB0D03                       3386
#define TXB0D04                       3387
#define TXB0D05                       3388
#define TXB0D06                       3389
#define TXB0D07                       3390
#define TXB0D1                        3391
#define TXB0D10                       3392
#define TXB0D11                       3393
#define TXB0D12                       3394
#define TXB0D13                       3395
#define TXB0D14                       3396
#define TXB0D15                       3397
#define TXB0D16                       3398
#define TXB0D17                       3399
#define TXB0D2                        3400
#define TXB0D20                       3401
#define TXB0D21                       3402
#define TXB0D22                       3403
#define TXB0D23                       3404
#define TXB0D24                       3405
#define TXB0D25                       3406
#define TXB0D26                       3407
#define TXB0D27                       3408
#define TXB0D3                        3409
#define TXB0D30                       3410
#define TXB0D31                       3411
#define TXB0D32                       3412
#define TXB0D33                       3413
#define TXB0D34                       3414
#define TXB0D35                       3415
#define TXB0D36                       3416
#define TXB0D37                       3417
#define TXB0D40                       3418
#define TXB0D4                        3419
#define TXB0D41                       3420
#define TXB0D42                       3421
#define TXB0D43                       3422
#define TXB0D44                       3423
#define TXB0D45                       3424
#define TXB0D46                       3425
#define TXB0D47                       3426
#define TXB0D5                        3427
#define TXB0D50                       3428
#define TXB0D51                       3429
#define TXB0D52                       3430
#define TXB0D53                       3431
#define TXB0D54                       3432
#define TXB0D55                       3433
#define TXB0D56                       3434
#define TXB0D57                       3435
#define TXB0D60                       3436
#define TXB0D6                        3437
#define TXB0D61                       3438
#define TXB0D62                       3439
#define TXB0D63                       3440
#define TXB0D64                       3441
#define TXB0D65                       3442
#define TXB0D66                       3443
#define TXB0D67                       3444
#define TXB0D70                       3445
#define TXB0D7                        3446
#define TXB0D71                       3447
#define TXB0D72                       3448
#define TXB0D73                       3449
#define TXB0D74                       3450
#define TXB0D75                       3451
#define TXB0D76                       3452
#define TXB0D77                       3453
#define CANSTAT_RO1                   3454
#define CANSTAT_RO1_EICODE0           3455
#define CANSTAT_RO1_ICODE0            3456
#define CANSTAT_RO1_EICODE1_ICODE0    3457
#define CANSTAT_RO1_EICODE1           3458
#define CANSTAT_RO1_ICODE1            3459
#define CANSTAT_RO1_EICODE2_ICODE1    3460
#define CANSTAT_RO1_EICODE2           3461
#define CANSTAT_RO1_ICODE2            3462
#define CANSTAT_RO1_EICODE3_ICODE2    3463
#define CANSTAT_RO1_EICODE3           3464
#define CANSTAT_RO1_EICODE4           3465
#define CANSTAT_RO1_OPMODE            3466
#define CANSTAT_RO1_OPMODE0           3467
#define CANSTAT_RO1_OPMODE1           3468
#define CANSTAT_RO1_OPMODE2           3469
#define CANCON_RO1                    3470
#define CANCON_RO1_FP0                3471
#define CANCON_RO1_WIN0               3472
#define CANCON_RO1_FP1                3473
#define CANCON_RO1_WIN0_FP1           3474
#define CANCON_RO1_WIN1               3475
#define CANCON_RO1_FP2                3476
#define CANCON_RO1_WIN1_FP2           3477
#define CANCON_RO1_WIN2               3478
#define CANCON_RO1_FP3                3479
#define CANCON_RO1_WIN2_FP3           3480
#define CANCON_RO1_ABAT               3481
#define CANCON_RO1_REQOP              3482
#define RXB1CON                       3483
#define RXB1CON_FILHIT0               3484
#define RXB1FILHIT0                   3485
#define RXB1CON_FILHIT1               3486
#define RXB1FILHIT1                   3487
#define RXB1CON_FILHIT2               3488
#define RXB1FILHIT2                   3489
#define RXB1CON_RXRTRRO               3490
#define RXB1CON_FILHIT3               3491
#define RXB1RTRR0                     3492
#define RXB1FILHIT3                   3493
#define RXB1CON_RXRTRRO_FILHIT3       3494
#define RXB1CON_FILHIT4               3495
#define RXB1FILHIT4                   3496
#define RXB1M0                        3497
#define RXB1CON_RXM0_RTRRO            3498
#define RXB1RTRRO                     3499
#define RXB1CON_RTRRO                 3500
#define RXB1CON_RXM0                  3501
#define RXB1M1                        3502
#define RXB1CON_RXM1                  3503
#define RXB1FUL                       3504
#define RXB1CON_RXFUL                 3505
#define RXB1SIDH                      3506
#define RXB1SID3                      3507
#define RXB1SIDH_SID                  3508
#define RXB1SIDH_SID3                 3509
#define RXB1SID4                      3510
#define RXB1SIDH_SID4                 3511
#define RXB1SID5                      3512
#define RXB1SIDH_SID5                 3513
#define RXB1SID6                      3514
#define RXB1SIDH_SID6                 3515
#define RXB1SID7                      3516
#define RXB1SIDH_SID7                 3517
#define RXB1SID8                      3518
#define RXB1SIDH_SID8                 3519
#define RXB1SID9                      3520
#define RXB1SIDH_SID9                 3521
#define RXB1SIDH_SID10                3522
#define RXB1SID10                     3523
#define RXB1SIDL                      3524
#define RXB1EID16                     3525
#define EDI16                         3526
#define RXB1SIDL_EID                  3527
#define RXB1EID17                     3528
#define EDI17                         3529
#define RXB1EXID                      3530
#define RXB1SIDL_EXID                 3531
#define RXB1SRR                       3532
#define RXB1SIDL_SRR                  3533
#define RXB1SIDL_SID0                 3534
#define RXB1SIDL_SID                  3535
#define RXB1SID0                      3536
#define RXB1SIDL_SID1                 3537
#define RXB1SID1                      3538
#define RXB1SIDL_SID2                 3539
#define RXB1SID2                      3540
#define RXB1EIDH                      3541
#define RXB1EIDH_EID                  3542
#define RXB1EID8                      3543
#define RXB1EIDH_EID8                 3544
#define RXB1EID9                      3545
#define RXB1EIDH_EID9                 3546
#define RXB1EIDH_EID10                3547
#define RXB1EID10                     3548
#define RXB1EIDH_EID11                3549
#define RXB1EID11                     3550
#define RXB1EIDH_EID12                3551
#define RXB1EID12                     3552
#define RXB1EID13                     3553
#define RXB1EIDH_EID13                3554
#define RXB1EIDH_EID14                3555
#define RXB1EID14                     3556
#define RXB1EIDH_EID15                3557
#define RXB1EID15                     3558
#define RXB1EIDL                      3559
#define RXB1EIDL_EID                  3560
#define RXB1EIDL_EID0                 3561
#define RXB1EID0                      3562
#define RXB1EIDL_EID1                 3563
#define RXB1EID1                      3564
#define RXB1EIDL_EID2                 3565
#define RXB1EID2                      3566
#define RXB1EIDL_EID3                 3567
#define RXB1EID3                      3568
#define RXB1EIDL_EID4                 3569
#define RXB1EID4                      3570
#define RXB1EIDL_EID5                 3571
#define RXB1EID5                      3572
#define RXB1EIDL_EID6                 3573
#define RXB1EID6                      3574
#define RXB1EIDL_EID7                 3575
#define RXB1EID7                      3576
#define RXB1DLC                       3577
#define RXB1DLC0                      3578
#define RXB1DLC_DLC                   3579
#define RXB1DLC_DLC0                  3580
#define RXB1DLC1                      3581
#define RXB1DLC_DLC1                  3582
#define RXB1DLC2                      3583
#define RXB1DLC_DLC2                  3584
#define RXB1DLC3                      3585
#define RXB1DLC_DLC3                  3586
#define RXB1DLC_RB                    3587
#define RXB1RB0                       3588
#define RXB1DLC_RB0                   3589
#define RXB1RB1                       3590
#define RXB1DLC_RB1                   3591
#define RXB1DLC_RXRTR                 3592
#define RXB1RTR                       3593
#define RXB1D0                        3594
#define RXB1D00                       3595
#define RXB1D01                       3596
#define RXB1D02                       3597
#define RXB1D03                       3598
#define RXB1D04                       3599
#define RXB1D05                       3600
#define RXB1D06                       3601
#define RXB1D07                       3602
#define RXB1D1                        3603
#define RXB1D10                       3604
#define RXB1D11                       3605
#define RXB1D12                       3606
#define RXB1D13                       3607
#define RXB1D14                       3608
#define RXB1D15                       3609
#define RXB1D16                       3610
#define RXB1D17                       3611
#define RXB1D2                        3612
#define RXB1D20                       3613
#define RXB1D21                       3614
#define RXB1D22                       3615
#define RXB1D23                       3616
#define RXB1D24                       3617
#define RXB1D25                       3618
#define RXB1D26                       3619
#define RXB1D27                       3620
#define RXB1D3                        3621
#define RXB1D30                       3622
#define RXB1D31                       3623
#define RXB1D32                       3624
#define RXB1D33                       3625
#define RXB1D34                       3626
#define RXB1D35                       3627
#define RXB1D36                       3628
#define RXB1D37                       3629
#define RXB1D40                       3630
#define RXB1D4                        3631
#define RXB1D41                       3632
#define RXB1D42                       3633
#define RXB1D43                       3634
#define RXB1D44                       3635
#define RXB1D45                       3636
#define RXB1D46                       3637
#define RXB1D47                       3638
#define RXB1D50                       3639
#define RXB1D5                        3640
#define RXB1D51                       3641
#define RXB1D52                       3642
#define RXB1D53                       3643
#define RXB1D54                       3644
#define RXB1D55                       3645
#define RXB1D56                       3646
#define RXB1D57                       3647
#define RXB1D6                        3648
#define RXB1D60                       3649
#define RXB1D61                       3650
#define RXB1D62                       3651
#define RXB1D63                       3652
#define RXB1D64                       3653
#define RXB1D65                       3654
#define RXB1D66                       3655
#define RXB1D67                       3656
#define RXB1D70                       3657
#define RXB1D7                        3658
#define RXB1D71                       3659
#define RXB1D72                       3660
#define RXB1D73                       3661
#define RXB1D74                       3662
#define RXB1D75                       3663
#define RXB1D76                       3664
#define RXB1D77                       3665
#define CANSTAT_RO0                   3666
#define CANSTAT_RO0_EICODE0           3667
#define CANSTAT_RO0_EICODE1_ICODE0    3668
#define CANSTAT_RO0_ICODE0            3669
#define CANSTAT_RO0_EICODE1           3670
#define CANSTAT_RO0_ICODE1            3671
#define CANSTAT_RO0_EICODE2_ICODE1    3672
#define CANSTAT_RO0_EICODE2           3673
#define CANSTAT_RO0_ICODE2            3674
#define CANSTAT_RO0_EICODE3           3675
#define CANSTAT_RO0_EICODE3_ICODE2    3676
#define CANSTAT_RO0_EICODE4           3677
#define CANSTAT_RO0_OPMODE0           3678
#define CANSTAT_RO0_OPMODE            3679
#define CANSTAT_RO0_OPMODE1           3680
#define CANSTAT_RO0_OPMODE2           3681
#define CANCON_RO0                    3682
#define CANCON_RO0_FP0                3683
#define CANCON_RO0_FP1                3684
#define CANCON_RO0_WIN0               3685
#define CANCON_RO0_WIN0_FP1           3686
#define CANCON_RO0_WIN1               3687
#define CANCON_RO0_WIN1_FP2           3688
#define CANCON_RO0_FP2                3689
#define CANCON_RO0_WIN2_FP3           3690
#define CANCON_RO0_WIN2               3691
#define CANCON_RO0_FP3                3692
#define CANCON_RO0_ABAT               3693
#define CANCON_RO0_REQOP              3694
#define PSPCON                        3695
#define PSPMODE                       3696
#define IBOV                          3697
#define OBF                           3698
#define IBF                           3699
#define CCP5CON                       3700
#define CCP5M0                        3701
#define CCP5M                         3702
#define CCP5M1                        3703
#define CCP5M2                        3704
#define CCP5M3                        3705
#define CCP5Y                         3706
#define DC5B0                         3707
#define DC5B                          3708
#define CCP5X                         3709
#define DC5B1                         3710
#define CCPR5L                        3711
#define CCPR5H                        3712
#define CCP4CON                       3713
#define CCP4M                         3714
#define CCP4M0                        3715
#define CCP4M1                        3716
#define CCP4M2                        3717
#define CCP4M3                        3718
#define CCP4Y                         3719
#define DC4B0                         3720
#define DC4B                          3721
#define CCP4X                         3722
#define DC4B1                         3723
#define CCPR4L                        3724
#define CCPR4H                        3725
#define CCP3CON                       3726
#define CCP3M                         3727
#define CCP3M0                        3728
#define CCP3M1                        3729
#define CCP3M2                        3730
#define CCP3M3                        3731
#define CCP3Y                         3732
#define DC3B                          3733
#define DC3B0                         3734
#define DC3B1                         3735
#define CCP3X                         3736
#define CCPR3L                        3737
#define CCPR3H                        3738
#define CCP2CON                       3739
#define CCP2M                         3740
#define CCP2M0                        3741
#define CCP2M1                        3742
#define CCP2M2                        3743
#define CCP2M3                        3744
#define DC2B0                         3745
#define CCP2Y                         3746
#define DC2B                          3747
#define DC2B1                         3748
#define CCP2X                         3749
#define CCPR2L                        3750
#define CCPR2H                        3751
#define CTMUICON                      3752
#define IRNG                          3753
#define IRNG0                         3754
#define IRNG1                         3755
#define ITRIM0                        3756
#define ITRIM                         3757
#define ITRIM1                        3758
#define ITRIM2                        3759
#define ITRIM3                        3760
#define ITRIM4                        3761
#define ITRIM5                        3762
#define CTMUCONL                      3763
#define EDG1STAT                      3764
#define EDG2STAT                      3765
#define EDG1SEL                       3766
#define EDG1SEL0                      3767
#define EDG1SEL1                      3768
#define EDG1POL                       3769
#define EDG2SEL0                      3770
#define EDG2SEL                       3771
#define EDG2SEL1                      3772
#define EDG2POL                       3773
#define CTMUCONH                      3774
#define CTTRIG                        3775
#define IDISSEN                       3776
#define EDGSEQEN                      3777
#define EDGEN                         3778
#define TGEN                          3779
#define CTMUSIDL                      3780
#define CTMUEN                        3781
#define PADCFG1                       3782
#define CTMUDS                        3783
#define PMPTTL                        3784
#define REPU                          3785
#define RDPU                          3786
#define PMD2                          3787
#define CMP1MD                        3788
#define CMP2MD                        3789
#define ECANMD                        3790
#define PMD1                          3791
#define EMBMD                         3792
#define TMR0MD                        3793
#define TMR1MD                        3794
#define TMR2MD                        3795
#define TMR3MD                        3796
#define TMR4MD                        3797
#define ADCMD                         3798
#define CTMUMD                        3799
#define PSPMD                         3800
#define PMD0                          3801
#define SSPMD                         3802
#define SPI1MD                        3803
#define UART1MD                       3804
#define SPI2MD                        3805
#define UART2MD                       3806
#define CCP1MD                        3807
#define CCP2MD                        3808
#define CCP3MD                        3809
#define CCP4MD                        3810
#define CCP5MD                        3811
#define IOCB                          3812
#define IOCB4                         3813
#define IOCB5                         3814
#define IOCB6                         3815
#define IOCB7                         3816
#define WPUB                          3817
#define WPUB0                         3818
#define WPUB1                         3819
#define WPUB2                         3820
#define WPUB3                         3821
#define WPUB4                         3822
#define WPUB5                         3823
#define WPUB6                         3824
#define WPUB7                         3825
#define ANCON1                        3826
#define ANSEL8                        3827
#define PCFG8                         3828
#define ANSEL9                        3829
#define PCFG9                         3830
#define PCFG10                        3831
#define ANSEL10                       3832
#define ANSEL11                       3833
#define PCFG11                        3834
#define PCFG12                        3835
#define ANSEL12                       3836
#define PCFG13                        3837
#define ANSEL13                       3838
#define PCFG14                        3839
#define ANSEL14                       3840
#define ANCON0                        3841
#define ANSEL0                        3842
#define PCFG0                         3843
#define ANSEL1                        3844
#define PCFG1                         3845
#define ANSEL2                        3846
#define PCFG2                         3847
#define ANSEL3                        3848
#define PCFG3                         3849
#define ANSEL4                        3850
#define PCFG4                         3851
#define ANSEL5                        3852
#define PCFG5                         3853
#define ANSEL6                        3854
#define PCFG6                         3855
#define ANSEL7                        3856
#define PCFG7                         3857
#define CM2CON                        3858
#define CM2CON_CCH                    3859
#define CM2CON_CCH0                   3860
#define CCH02                         3861
#define CCH12                         3862
#define CM2CON_CCH1                   3863
#define CM2CON_CREF                   3864
#define CREF2                         3865
#define CM2CON_EVPOL                  3866
#define EVPOL02                       3867
#define CM2CON_EVPOL0                 3868
#define EVPOL12                       3869
#define CM2CON_EVPOL1                 3870
#define CM2CON_CPOL                   3871
#define CPOL2                         3872
#define CM2CON_COE                    3873
#define COE2                          3874
#define CM2CON_CON                    3875
#define CON2                          3876
#define CM1CON                        3877
#define CM1CON_CCH                    3878
#define C1CH0                         3879
#define CM1CON_CCH0                   3880
